app/views/messages/show.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."message_id" = ?  [["message_id", 4]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."message_id" = ?  [["message_id", 4]]
---

      <b><%= @message.replies.count %> replies</b>