app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY created_at DESC
---
  def all
    @messages = Message.all.order("created_at DESC")

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Test"], ["created_at", "2019-12-15 21:21:00.905834"], ["updated_at", "2019-12-15 21:21:00.905834"], ["user_id", 1]]
---
  def create
    @message = current_user.messages.build(getMessageContent)

    # redirect to the message that was created
    if @message.save

UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "Other posts 2 3"], ["updated_at", "2019-12-15 21:44:00.701444"], ["id", 4]]
---
  def update
    # don't allow different users to edit messages that aren't theirs
    if @message.user.id == current_user.id
    # if update is called with the content parameter
      if @message.update(getMessageContent)

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 3]]
---
  def destroy
    # don't allow different users to delete messages that aren't theirs
    if @message.user.id == current_user.id
      @message.destroy