app/controllers/replies_controller.rb

  def create
    # get current on message id, and create a reply with the content in the params
    @message = Message.find(params[:message_id])
    @reply = @message.replies.create(params[:reply].permit(:content))
    @reply.user_id = current_user.id

    # save the reply
    @reply.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "replies" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Test"], ["message_id", 4], ["user_id", 1], ["created_at", "2019-12-16 13:40:39.343663"], ["updated_at", "2019-12-16 13:40:39.343663"]]
INSERT INTO "replies" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello There"], ["message_id", 4], ["user_id", 1], ["created_at", "2019-12-16 14:23:28.652107"], ["updated_at", "2019-12-16 14:23:28.652107"]]

  def destroy
    # find the reply to destroy and set it as a variable
    @message = Message.find(params[:message_id])
    @reply = @message.replies.find(params[:id])

    # destroy/delete the reply & redirect to the message again
    @reply.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "replies".* FROM "replies" WHERE "replies"."message_id" = ? AND "replies"."id" = ? LIMIT ?  [["message_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 1]]